Repository: Vigilo/common
Catalog: i18n/*/LC_MESSAGES/vigilo-common.po
Languages: fr

source: conflicting option string(s): %s
fr: conflit d'options : %s

source: subcommands
fr: sous-commandes

source: unrecognized arguments: %s
fr: arguments non reconnus : %s

source: expected one argument
fr: un argument attendu

source: expected at most one argument
fr: au plus un argument attendu

source: expected at least one argument
fr: au moins un argument attendu

source: expected %s argument(s)
fr: %s argument(s) attendu(s)

source: invalid choice: %r (choose from %s)
fr: choix incorrect : %r (choisissez parmis %s)

source: positional arguments
fr: arguments positionnels

source: optional arguments
fr: arguments optionnels

source: too few arguments
fr: pas assez d'arguments

source: argument %s is required
fr: l'argument %s est nécessaire

source: one of the arguments %s is required
fr: l'un des arguments %s est nécessaire

source: %s: error: %s
fr: %s : erreur : %s

source: show this help message and exit
fr: affiche ce message d'aide et quitte

source: show program's version number and exit
fr: affiche le numéro de version du programme et quitte

source: no such option: %s
fr: option inexistante : %s

source: ambiguous option: %s (%s?)
fr: option ambigue : %s (%s ?)

source: integer
fr: nombre entier

source: long integer
fr: nombre entier long

source: floating-point
fr: nombre décimal

source: complex
fr: nombre complexe

source: option %s: invalid %s value: %r
fr: option %s : %s non valide : %r

source: option %s: invalid choice: %r (choose from %s)
fr: option %s : choix incorrect : %r (choisissez parmis %s)

source: %s option requires an argument
fr: l'option %s requiert un argument

source: %s option requires %d arguments
fr: l'option %s requiert %d arguments

source: %s option does not take a value
fr: l'option %s ne prend pas d'argument

source: No configuration file found
fr: Fichier de configuration introuvable

source: Skipping "%(item)s": (version conflict "%(error)s")
fr: "%(item)s" ignoré : conflit de version "%(error)s"

source: Skipping "%(item)s": (unknown extra "%(error)s")
fr: "%(item)s" ignoré : extrat inconnu "%(error)s"

source: Skipping "%(item)s": (can't import "%(error)s")
fr: "%(item)s" ignoré : impossible d'importer "%(error)s"

source: Skipping "%(item)s": (error "%(error)s")
fr: "%(item)s" ignoré : erreur "%(error)s"

source: No such file: %s
fr: Fichier inexistant : %s

source: No such section: %s
fr: Section inexistante : %s

source: No such key: %s
fr: Entrée inexistante : %s

source: Can't obtain lock on lockfile (%(lockfile)s). Application already running? REASON: %(error)s
fr: Impossible d'obtenir un verrou sur le fichier (%(lockfile)s). L'application est-elle déjà en fonctionnement ? RAISON : %(error)s

source: Displays the name and location of the Python package which provides this feature.
fr: Affiche le nom et l'emplacement du paquet Python qui fournit cette fonctionnalité.

source: Available entry-points groups:
fr: Groupes de points d'entrée disponibles :

source: Provided by:
fr: Fournit par :
